#include <stdio.h>  
#include <math.h> //для sqrt 

int main() {
    double x, f; //змінні x (вхідне число) і f (результат функції)

  
    printf("Введіть значення x: ");
    scanf("%lf", &x); 

    // перевіряємо, яке значення має x, і рахуємо f(x)
    if (x < -10) {
        // якщо x менше -10, рахуємо за формулою 3x^3 - x^2
        f = 3 * x * x * x - x * x;
    } else if (x <= 10) {
        // якщо x від -10 до 10 включно, рахуємо корінь з (10 - x)
        f = sqrt(10 - x); 
    } else {
        // якщо x більше 10, рахуємо 2x + 1
        f = 2 * x + 1;
    }

    printf("f(x) = %.4lf\n", f);

    return 0; 
}
